# Rebar Bar Type Get Crank Offset Length Method

Source: https://www.revitapidocs.com/2026/67b37903-0b2a-c06e-1c9d-7c3f30010c5f.htm

---

| Rebar Bar Type Get Crank Offset Length Method |
| --- |

Gets the crank offset taking into account the specified Rebar Crank Type.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double GetCrankOffsetLength(
	ElementId rebarCrankTypeId
)
```

```
Public Function GetCrankOffsetLength (
	rebarCrankTypeId As ElementId
) As Double
```

```
public:
double GetCrankOffsetLength(
	ElementId^ rebarCrankTypeId
)
```

```
member GetCrankOffsetLength :
        rebarCrankTypeId : ElementId -> float
```

#### Parameters

rebarCrankTypeId ElementId
:   The Rebar Crank Type id.
 Interactions with Rebar Crank Types can be done with the functions in \[!:Autodesk::Revit::DB::Structure::RebarCrankTypeUtils] .

#### Return Value

Double
Returns the crank offset length. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST\_RebarCrankType category. |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

RebarBarType Class Autodesk.Revit.DB.Structure Namespace